#include <stdio.h>
#include <math.h>

int main() {
    double x, z;

    // Ввод аргумента x с клавиатуры
    printf("Введите значение аргумента x: ");
    scanf("%f", &x);

    // Проверка принадлежности аргумента ООФ
    if (x == M_PI_2 || x == -M_PI_2) {
        printf("Аргумент x не принадлежит ООФ функции.\n");
        return 0;
    }
    if (fabs(sin(x)/12+(exp(x*x)-5)) <= 0) {
        printf("Аргумент x не принадлежит ООФ функции.\n");
        return 0;
    }
    if (x == 0) {
        printf("Аргумент x не принадлежит ООФ функции.\n");
        return 0;
    }

    // Вычисление значения функции z
    z = tan(x) - log(sqrt(fabs(sin(x)/12+(exp(x*x)-5)))-1/(2*x)*(2*x)*(2*x));

    // Вывод результата на экран
    printf("Значение функции z при x = %f: %f\n", x, z);

    return 0;
}
